[Killed] ConditionalExpression
src/gilded_rose.mjs:15:21
   }
 
   updateQuality() {
-    for (var i = 0; i < this.items.length; i++) {
+    for (var i = 0; false; i++) {
       const item = this.items[i];
       switch (item.name) {
killedBy: Gilded Rose (foo, 0, 0)
statusReason: expected +0 to equal -1

[Killed] UpdateOperator
src/gilded_rose.mjs:15:44
   }
 
   updateQuality() {
-    for (var i = 0; i < this.items.length; i++) {
+    for (var i = 0; i < this.items.length; i--) {
       const item = this.items[i];
       switch (item.name) {
killedBy: Gilded Rose (foo, 0, 0)
statusReason: Cannot read properties of undefined (reading 'name')

[Killed] BlockStatement
src/gilded_rose.mjs:18:44
     for (var i = 0; i < this.items.length; i++) {
       const item = this.items[i];
       switch (item.name) {
-        case "Sulfuras, Hand of Ragnaros": {
-          continue;
-        }
+        case "Sulfuras, Hand of Ragnaros": {}
         case "Aged Brie": {
           item.quality++;
killedBy: Gilded Rose (sulfuras, -1, 1)
statusReason: expected -2 to equal -1

[Killed] ConditionalExpression
src/gilded_rose.mjs:18:9
     for (var i = 0; i < this.items.length; i++) {
       const item = this.items[i];
       switch (item.name) {
-        case "Sulfuras, Hand of Ragnaros": {
-          continue;
-        }
+        case "Sulfuras, Hand of Ragnaros":
         case "Aged Brie": {
           item.quality++;
killedBy: Gilded Rose (sulfuras, -1, 1)
statusReason: expected -2 to equal -1

[Killed] ConditionalExpression
src/gilded_rose.mjs:21:9
         case "Sulfuras, Hand of Ragnaros": {
           continue;
         }
-        case "Aged Brie": {
-          item.quality++;
-          break;
-        }
+        case "Aged Brie":
         case "Backstage passes to a TAFKAL80ETC concert": {
           item.quality++;
killedBy: Gilded Rose (aged brie, 0, 0)
statusReason: expected 4 to equal 2

[Killed] BlockStatement
src/gilded_rose.mjs:21:27
         case "Sulfuras, Hand of Ragnaros": {
           continue;
         }
-        case "Aged Brie": {
-          item.quality++;
-          break;
-        }
+        case "Aged Brie": {}
         case "Backstage passes to a TAFKAL80ETC concert": {
           item.quality++;
killedBy: Gilded Rose (aged brie, 0, 0)
statusReason: expected 4 to equal 2

[Killed] UpdateOperator
src/gilded_rose.mjs:22:11
           continue;
         }
         case "Aged Brie": {
-          item.quality++;
+          item.quality--;
           break;
         }
killedBy: Gilded Rose (aged brie, 0, 0)
statusReason: expected +0 to equal 2

[Killed] ConditionalExpression
src/gilded_rose.mjs:25:9
           item.quality++;
           break;
         }
-        case "Backstage passes to a TAFKAL80ETC concert": {
-          item.quality++;
-          if (item.sellIn < 11) {
-            item.quality++;
-          }
-          if (item.sellIn < 6) {
-            item.quality++;
-          }
-          break;
-        }
+        case "Backstage passes to a TAFKAL80ETC concert":
         case "Conjured": {
           item.quality--;
killedBy: Gilded Rose (backstage passes, 1, 0)
statusReason: expected +0 to equal 3

[Killed] BlockStatement
src/gilded_rose.mjs:25:59
           item.quality++;
           break;
         }
-        case "Backstage passes to a TAFKAL80ETC concert": {
-          item.quality++;
-          if (item.sellIn < 11) {
-            item.quality++;
-          }
-          if (item.sellIn < 6) {
-            item.quality++;
-          }
-          break;
-        }
+        case "Backstage passes to a TAFKAL80ETC concert": {}
         case "Conjured": {
           item.quality--;
killedBy: Gilded Rose (backstage passes, 1, 0)
statusReason: expected +0 to equal 3

[Killed] UpdateOperator
src/gilded_rose.mjs:26:11
           break;
         }
         case "Backstage passes to a TAFKAL80ETC concert": {
-          item.quality++;
+          item.quality--;
           if (item.sellIn < 11) {
             item.quality++;
killedBy: Gilded Rose (backstage passes, 1, 0)
statusReason: expected 1 to equal 3

[Killed] BlockStatement
src/gilded_rose.mjs:27:33
         }
         case "Backstage passes to a TAFKAL80ETC concert": {
           item.quality++;
-          if (item.sellIn < 11) {
-            item.quality++;
-          }
+          if (item.sellIn < 11) {}
           if (item.sellIn < 6) {
             item.quality++;
killedBy: Gilded Rose (backstage passes, 1, 0)
statusReason: expected 2 to equal 3

[Killed] ConditionalExpression
src/gilded_rose.mjs:27:15
         }
         case "Backstage passes to a TAFKAL80ETC concert": {
           item.quality++;
-          if (item.sellIn < 11) {
+          if (true) {
             item.quality++;
           }
killedBy: Gilded Rose (backstage passes, 11, 0)
statusReason: expected 2 to equal 1

[Killed] UpdateOperator
src/gilded_rose.mjs:28:13
         case "Backstage passes to a TAFKAL80ETC concert": {
           item.quality++;
           if (item.sellIn < 11) {
-            item.quality++;
+            item.quality--;
           }
           if (item.sellIn < 6) {
killedBy: Gilded Rose (backstage passes, 1, 0)
statusReason: expected 1 to equal 3

[Killed] EqualityOperator
src/gilded_rose.mjs:30:15
           if (item.sellIn < 11) {
             item.quality++;
           }
-          if (item.sellIn < 6) {
+          if (item.sellIn >= 6) {
             item.quality++;
           }
killedBy: Gilded Rose (backstage passes, 1, 0)
statusReason: expected 2 to equal 3

[Killed] ConditionalExpression
src/gilded_rose.mjs:30:15
           if (item.sellIn < 11) {
             item.quality++;
           }
-          if (item.sellIn < 6) {
+          if (false) {
             item.quality++;
           }
killedBy: Gilded Rose (backstage passes, 1, 0)
statusReason: expected 2 to equal 3

[Killed] UpdateOperator
src/gilded_rose.mjs:31:13
             item.quality++;
           }
           if (item.sellIn < 6) {
-            item.quality++;
+            item.quality--;
           }
           break;
killedBy: Gilded Rose (backstage passes, 1, 0)
statusReason: expected 1 to equal 3

[Killed] BlockStatement
src/gilded_rose.mjs:35:26
           }
           break;
         }
-        case "Conjured": {
-          item.quality--;
-          item.quality--;
-          break;
-        }
+        case "Conjured": {}
         default: {
           item.quality--;
killedBy: Gilded Rose (conjured, 2, 3)
statusReason: expected 2 to equal 1

[Killed] ConditionalExpression
src/gilded_rose.mjs:35:9
           }
           break;
         }
-        case "Conjured": {
-          item.quality--;
-          item.quality--;
-          break;
-        }
+        case "Conjured":
         default: {
           item.quality--;
killedBy: Gilded Rose (conjured, 2, 3)
statusReason: expected 2 to equal 1

[Killed] UpdateOperator
src/gilded_rose.mjs:36:11
           break;
         }
         case "Conjured": {
-          item.quality--;
+          item.quality++;
           item.quality--;
           break;
killedBy: Gilded Rose (conjured, 2, 3)
statusReason: expected 3 to equal 1

[Killed] UpdateOperator
src/gilded_rose.mjs:37:11
         }
         case "Conjured": {
           item.quality--;
-          item.quality--;
+          item.quality++;
           break;
         }
killedBy: Gilded Rose (conjured, 2, 3)
statusReason: expected 3 to equal 1

[Killed] ConditionalExpression
src/gilded_rose.mjs:40:9
           item.quality--;
           break;
         }
-        default: {
-          item.quality--;
-        }
+        default:
       }
 
killedBy: Gilded Rose (foo, 0, 3)
statusReason: expected 2 to equal 1

[Killed] BlockStatement
src/gilded_rose.mjs:40:18
           item.quality--;
           break;
         }
-        default: {
-          item.quality--;
-        }
+        default: {}
       }
 
killedBy: Gilded Rose (foo, 0, 3)
statusReason: expected 2 to equal 1

[Killed] UpdateOperator
src/gilded_rose.mjs:41:11
           break;
         }
         default: {
-          item.quality--;
+          item.quality++;
         }
       }
killedBy: Gilded Rose (foo, 0, 3)
statusReason: expected 3 to equal 1

[Killed] UpdateOperator
src/gilded_rose.mjs:45:7
         }
       }
 
-      item.sellIn--;
+      item.sellIn++;
 
       if (item.sellIn < 0) {
killedBy: Gilded Rose (foo, 0, 0)
statusReason: expected 1 to equal -1

[Killed] ConditionalExpression
src/gilded_rose.mjs:47:11
 
       item.sellIn--;
 
-      if (item.sellIn < 0) {
+      if (false) {
         switch (item.name) {
           case "Aged Brie": {
killedBy: Gilded Rose (foo, 0, 3)
statusReason: expected 2 to equal 1

[Killed] ConditionalExpression
src/gilded_rose.mjs:47:11
 
       item.sellIn--;
 
-      if (item.sellIn < 0) {
+      if (true) {
         switch (item.name) {
           case "Aged Brie": {
killedBy: Gilded Rose (backstage passes, 1, 0)
statusReason: expected +0 to equal 3

[Killed] ConditionalExpression
src/gilded_rose.mjs:49:11
 
       if (item.sellIn < 0) {
         switch (item.name) {
-          case "Aged Brie": {
-            item.quality++;
-            break;
-          }
+          case "Aged Brie":
           case "Backstage passes to a TAFKAL80ETC concert": {
             item.quality = 0;
killedBy: Gilded Rose (aged brie, 0, 0)
statusReason: expected +0 to equal 2

[Killed] BlockStatement
src/gilded_rose.mjs:49:29
 
       if (item.sellIn < 0) {
         switch (item.name) {
-          case "Aged Brie": {
-            item.quality++;
-            break;
-          }
+          case "Aged Brie": {}
           case "Backstage passes to a TAFKAL80ETC concert": {
             item.quality = 0;
killedBy: Gilded Rose (aged brie, 0, 0)
statusReason: expected +0 to equal 2

[Killed] ConditionalExpression
src/gilded_rose.mjs:53:11
             item.quality++;
             break;
           }
-          case "Backstage passes to a TAFKAL80ETC concert": {
-            item.quality = 0;
-            break;
-          }
+          case "Backstage passes to a TAFKAL80ETC concert":
           case "Conjured": {
             item.quality--;
killedBy: Gilded Rose (backstage passes, 0, 0)
statusReason: expected 1 to equal +0

[Killed] BlockStatement
src/gilded_rose.mjs:53:61
             item.quality++;
             break;
           }
-          case "Backstage passes to a TAFKAL80ETC concert": {
-            item.quality = 0;
-            break;
-          }
+          case "Backstage passes to a TAFKAL80ETC concert": {}
           case "Conjured": {
             item.quality--;
killedBy: Gilded Rose (backstage passes, 0, 0)
statusReason: expected 1 to equal +0

[Killed] MethodExpression
src/gilded_rose.mjs:68:34
         }
       }
 
-      item.quality = Math.max(0, Math.min(50, item.quality));
+      item.quality = Math.max(0, Math.max(50, item.quality));
     }
 
killedBy: Gilded Rose (foo, 0, 0)
statusReason: expected 50 to equal +0

[Killed] MethodExpression
src/gilded_rose.mjs:68:22
         }
       }
 
-      item.quality = Math.max(0, Math.min(50, item.quality));
+      item.quality = Math.min(0, Math.min(50, item.quality));
     }
 
killedBy: Gilded Rose (foo, 0, 0)
statusReason: expected -2 to equal +0
